diplom-src/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбоненскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

diplom-src/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбаненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

diplom-src/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	//{{Алексеев.М.Д.: Добавление реквизитов на формы "ПериооДейстыия","СуммаАбаненскойПлаты", "СтоимостьЧасаРаботы" с условием 
	Группа = Элементы.Добавить("ГруппаШапка", Тип("ГруппаФормы"), ЭтотОбъект);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Заголовок = "Заполните рекквизиты договора Абаненского Облуживания:";
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Если Объект.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбаненскоеОбслуживание Тогда
		Группа.Видимость = Ложь;
	КонецЕсли;
	
	ДобовляемыеРеквизиты = Новый Массив;
	ДобовляемыеРеквизиты.Добавить("ВКМ_ДатаНачала");
	ДобовляемыеРеквизиты.Добавить("ВКМ_ДатаОкончания");
	ДобовляемыеРеквизиты.Добавить("ВКМ_СтоимостьЧасаРаботы");
	ДобовляемыеРеквизиты.Добавить("ВКМ_СуммаАбоненскойПлаты");
	
	Для Каждого Реквизит Из ДобовляемыеРеквизиты Цикл
		ПолеПериодДействия = Элементы.Добавить(Реквизит, Тип("ПолеФормы"), Группа);
		ПолеПериодДействия.Вид = ВидПоляФормы.ПолеВвода;
		ПолеПериодДействия.ПутьКДанным = "Объект." + Реквизит;
	КонецЦикла;
	//}}
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	//{{Алексеев.М.Д.:
	ТекущиеДанные = Элементы.ГруппаШапка;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбаненскоеОбслуживание") Тогда
		ТекущиеДанные.Видимость = Истина;
	Иначе
		ТекущиеДанные.Видимость = Ложь;
	КонецЕсли;
	//}}
КонецПроцедуры
#КонецОбласти
